20240210T220439--kdoc-86-errorsisの比較ロジックを見る__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:11:50Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 86: errors.Is()の比較ロジックを見る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 86: errors.Is()の比較ロジックを見る</h1>
<div id="outline-container-org56f0bc0" class="outline-2">
<h2 id="org56f0bc0"><a href="#org56f0bc0">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org56f0bc0">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-17 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-18 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc27974b" class="outline-2">
<h2 id="orgc27974b"><a href="#orgc27974b">概要</a></h2>
<div class="outline-text-2" id="text-orgc27974b">
<p>
<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>のerror.Is()は、2つのエラーが一致するかを判定する関数。
</p>

<ul class="org-ul">
<li><a href="https://pkg.go.dev/errors#example-Is">errors package - errors - Go Packages</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-go">func Is(err, target error) bool {}
</pre>
</div>

<p>
エラー周りをいまいち理解してないが、調べるなかでエラーというより「一致(<code>==</code>)」とはなにかを理解していなかった。そのへんについて書く。
</p>
</div>
</div>
<div id="outline-container-orga86b45e" class="outline-2">
<h2 id="orga86b45e"><a href="#orga86b45e">ユースケースを見る</a></h2>
<div class="outline-text-2" id="text-orga86b45e">
<p>
まずIs()の使い方を理解する。<a href="https://pkg.go.dev/errors">errors package</a>のexampleを見る。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Is() example</label><pre class="src src-go">if _, err := os.Open("non-existing"); err != nil {
	if errors.Is(err, fs.ErrNotExist) {
		fmt.Println("file does not exist")
	} else {
		fmt.Println(err)
	}
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">file does not exist
</pre>
</div>

<p>
なんらかの方法で2つのエラー(err, fs.ErrNotExist)を比較し、結果を返している。
</p>

<p>
↓ここで、ErrNotExistはエラー変数である。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>ErrNotExist</label><pre class="src src-git-permalink">https://github.com/kd-collective/go/blob/b8ac61e6e64c92f23d8cf868a92a70d13e20a124/src/io/fs/fs.go#L146
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">ErrNotExist   = errNotExist()   // "file does not exist"
</pre>
</div>

<p>
↓さらに辿る。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>実態はoserror</label><pre class="src src-git-permalink">https://github.com/kd-collective/go/blob/b8ac61e6e64c92f23d8cf868a92a70d13e20a124/src/io/fs/fs.go#L153
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">func errNotExist() error   { return oserror.ErrNotExist }
</pre>
</div>

<p>
↓ようやく定義にたどり着く。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>internal packageのoserrorでの定義</label><pre class="src src-git-permalink">https://github.com/kd-collective/go/blob/b8ac61e6e64c92f23d8cf868a92a70d13e20a124/src/internal/oserror/errors.go#L12-L16
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">var (
	ErrInvalid    = errors.New("invalid argument")
	ErrPermission = errors.New("permission denied")
	ErrExist      = errors.New("file already exists")
	ErrNotExist   = errors.New("file does not exist")
</pre>
</div>

<p>
errors.New()が返す構造体*errors.errorStringはUnwrap()、Is()を実装していないから、エラーチェーンを辿ることはない。単純にerrors.New()で作られたエラー変数自体を「比較」していることになる。比較ロジックはなんだろうか。実装を見る。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kd-collective/go/blob/b8ac61e6e64c92f23d8cf868a92a70d13e20a124/src/errors/wrap.go#L55
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">if targetComparable &amp;&amp; err == target {
</pre>
</div>

<p>
シンプルに <code>==</code> で比較している。ひとくちに比較といってもいろいろある。型の要素が一致しているか、値が一致しているか、指すメモリアドレスが同じか、など。どうなるのだろうか。
</p>
</div>
</div>
<div id="outline-container-org32c4f48" class="outline-2">
<h2 id="org32c4f48"><a href="#org32c4f48">比較ロジック</a></h2>
<div class="outline-text-2" id="text-org32c4f48">
<p>
動かして調べる。値や、型名の比較ではないことを確認する。
</p>

<div class="org-src-container">
<pre class="src src-go">fmt.Println("↓falseになる")
fmt.Println(errors.Is(fs.ErrNotExist, errors.New("file does not exist")))
fmt.Println("↓==を使ってもfalseになる")
fmt.Println(fs.ErrNotExist == errors.New("file does not exist"))
fmt.Println("↓型は同じなのを確認する")
fmt.Printf("%T, %T\n", fs.ErrNotExist, errors.New("file does not exist"))
fmt.Println("↓フィールドの値は同じ")
fmt.Printf("%#v, %#v\n", fs.ErrNotExist, errors.New("file does not exist"))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">↓falseになる
false
↓==を使ってもfalseになる
false
↓型は同じなのを確認する
*errors.errorString, *errors.errorString
↓フィールドの値は同じ
&amp;errors.errorString{s:"file does not exist"}, &amp;errors.errorString{s:"file does not exist"}
</pre>
</div>

<p>
ここでよく見るとポインタ型なので、指すメモリアドレスを比較していると考えた。同じ変数だと、同じものを指しているので同じになるだろう。よく忘れるのだが、 <code>error</code> はインターフェースであって、型ではない。よく使われるerrors.New()は*errorString型のインスタンスを作成する。
</p>

<p>
メモリアドレスの比較であることを確かめる。
</p>

<div class="org-src-container">
<pre class="src src-go">// 値が完全に同じでも、メモリアドレスが違うのでfalse
fmt.Println(errors.New("dummy") == errors.New("dummy"))

e := errors.New("dummy")
// メモリアドレスが同じなのでtrue
fmt.Println(e == e)
// メモリアドレスが同じであればいいので別の変数に入れて元の変数と比較してもtrue
ee := e
fmt.Println(ee == e)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">false
true
true
</pre>
</div>

<p>
errorを実装している型をポインタ型でないものにすると、値で比較するため構造体の値が同じであれば同じ判定になる。現実で使うケースはなさそうだが。
</p>

<ul class="org-ul">
<li><a href="https://go.dev/play/p/qZe0EBI6td">https://go.dev/play/p/qZe0EBI6td</a>-</li>
</ul>

<div class="org-src-container">
<pre class="src src-go">package main

import (
	"errors"
	"fmt"
)

type dummy struct{ s string }

func (d dummy) Error() string { return "" }

var _ error = dummy{}

func main() {
	fmt.Println(errors.Is(dummy{}, dummy{}))       // true
	fmt.Println(errors.Is(dummy{"a"}, dummy{"b"})) // false
}

</pre>
</div>

<p>
フィールドの値で比較していることがわかる。
</p>
</div>
</div>
<div id="outline-container-orge5c7e97" class="outline-2">
<h2 id="orge5c7e97"><a href="#orge5c7e97">まとめ</a></h2>
<div class="outline-text-2" id="text-orge5c7e97">
<ul class="org-ul">
<li>errors.Is()はエラーチェーンをたどったり独自の判定ロジックを適用してくれるが、もっともシンプルな例だと単純に <code>==</code> で比較しているだけにすぎない</li>
<li><code>error</code> はインターフェースであり、よく見るerrors.New()で作られる変数の型はその実装の1つにすぎない</li>
<li>エラーのパッケージ変数はerrors.New()で作られる*errors.errorString型がよく使われる。ポインタなので、パッケージ変数として初期化・公開しておくと一致を安全に確認できる。ポインタ型なので、 <b><b>型で比較しているわけではない</b></b> 。</li>
</ul>
</div>
</div>
<div id="outline-container-org5e63d0d" class="outline-2">
<h2 id="org5e63d0d"><a href="#org5e63d0d">関連</a></h2>
<div class="outline-text-2" id="text-org5e63d0d">
<ul class="org-ul">
<li><a href="20231103T214003--kdoc-52-goで構造体がインターフェースを実装しているか確認する__wiki.html#ID-20231103T214003">KDOC 52: Goで構造体がインターフェースを実装しているか確認する</a>。サンプルコードでインターフェースを確認するのに使った</li>
</ul>
</div>
</div>
<div id="outline-container-orgd0c7088" class="outline-2">
<h2 id="orgd0c7088"><a href="#orgd0c7088">Backlinks</a></h2>
<div class="outline-text-2" id="text-orgd0c7088">
<ul class="org-ul">
<li><a href="./20240217T002258--kdoc-96-errorsasの使い方__wiki.html">KDOC 96: errors.As()の使い方</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
